ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_clb_logic_config_regs.xml
	<register id="CLB_FSM_LUT_FN2" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="LUT function for FSM Unit 2">
		<bitfield id="FN1" description="FSM LUT output function for unit 2" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_FN1_0" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="LUT function for LUT4 block of Unit 1 and 0">
		<bitfield id="FN0" description="LUT4 output function for unit 0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="FN1" description="LUT4 output function for unit 1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_FN2" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="LUT function for LUT4 block of Unit 2">
		<bitfield id="FN1" description="LUT4 output function for unit 2" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_NEXT_STATE_0" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="FSM Next state equations for Unit 0">
		<bitfield id="S0" description="FSM next state function for S0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="S1" description="FSM next state function for S1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_NEXT_STATE_1" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="FSM Next state equations for Unit 1">
		<bitfield id="S0" description="FSM next state function for S0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="S1" description="FSM next state function for S1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_NEXT_STATE_2" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="FSM Next state equations for Unit 2">
		<bitfield id="S0" description="FSM next state function for S0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="S1" description="FSM next state function for S1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_MISC_CONTROL" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Static controls for Ctr,FSM">
		<bitfield id="COUNT_ADD_SHIFT_0" description="Add/Shift for counter 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_DIR_0" description="Direction for counter 0" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_EVENT_CTRL_0" description="Event control for counter 0" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_ADD_SHIFT_1" description="Add/Shift for counter 1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_DIR_1" description="Direction for counter 1" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_EVENT_CTRL_1" description="Event control for counter 1" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_ADD_SHIFT_2" description="Add/Shift for counter 2" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_DIR_2" description="Direction for counter 2" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_EVENT_CTRL_2" description="Event control for counter 2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_SERIALIZER_0" description="Serializer enable 0" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_SERIALIZER_1" description="Serializer enable 1" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_SERIALIZER_2" description="Serializer enable 2" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL0_0" description="FSM extra_sel0 for 0" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL1_0" description="FSM extra_sel1 for 0" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL0_1" description="FSM extra_sel0 for 1" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL1_1" description="FSM extra_sel1 for 1" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL0_2" description="FSM extra_sel0 for 2" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL1_2" description="FSM extra_sel1 for 2" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="COUNT0_MATCH1_TAP_EN" description="Match1 Tap Enable for Counter 0" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH1_TAP_EN" description="Match1 Tap Enable for Counter 1" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH1_TAP_EN" description="Match1 Tap Enable for Counter 2" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="COUNT0_MATCH2_TAP_EN" description="Match2 Tap Enable for Counter 0" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH2_TAP_EN" description="Match2 Tap Enable for Counter 1" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH2_TAP_EN" description="Match2 Tap Enable for Counter 2" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="COUNT0_LFSR_EN" description="Enable LFSR mode for Counter 0" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="COUNT1_LFSR_EN" description="Enable LFSR mode for Counter 1" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="COUNT2_LFSR_EN" description="Enable LFSR mode for Counter 2" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_0" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out0">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_1" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out1">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_2" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out2">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_3" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out3">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_4" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out4">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_5" width="32" page="0" offset="0x6c" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out5">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_6" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out6">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_7" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="Inp Sel, LUT fns for Out7">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_HLC_EVENT_SEL" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Event Selector register for the High Level controller">
		<bitfield id="EVENT0_SEL" description="Event Select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="EVENT1_SEL" description="Event Select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="EVENT2_SEL" description="Event Select 2" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="EVENT3_SEL" description="Event Select 3" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="ALT_EVENT0_SEL" description="Event Select 3" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT1_SEL" description="Event Select 3" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT2_SEL" description="Event Select 3" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT3_SEL" description="Event Select 3" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_MATCH_TAP_SEL" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="Counter tap values for match1 and match2 outputs ">
		<bitfield id="COUNT0_MATCH1" description="Match1 tap select for Counter 0 " begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH1" description="Match1 tap select for Counter 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH1" description="Match1 tap select for Counter 2" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="COUNT0_MATCH2" description="Match2 tap select for Counter 0 " begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH2" description="Match2 tap select for Counter 1" begin="25" end="21" width="5" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH2" description="Match2 tap select for Counter 2" begin="30" end="26" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_0" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 0">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_1" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 1">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_2" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 2">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_3" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 3">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
