ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_clb_logic_config_regs.xml
	<register id="CLB_OUTPUT_COND_CTRL_4" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 4">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_5" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 5">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_6" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 6">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_7" width="32" page="0" offset="0x9c" instances="1" instaddr="4" internal="0" description="Output conditioning control for output 7">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_MISC_ACCESS_CTRL" width="16" page="0" offset="0xa0" instances="1" instaddr="2" internal="0" description="Miscellaneous Access and enable control">
		<bitfield id="SPIEN" description="Enable CLB SPI Buffer feature" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BLKEN" description="Block Register write" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_SPI_DATA_CTRL_HI" width="16" page="0" offset="0xa2" instances="1" instaddr="2" internal="0" description="CLB to SPI buffer control High">
		<bitfield id="STRB" description="Select value for strobe" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="STRB_DEL" description="Strobe delay enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SHIFT" description="Shift value select" begin="12" end="8" width="5" rwaccess="RW"/>
	</register>
</module>
